{
        "Leagues": [{
          "idLeague": "4328",
          "idSoccerXML": null,
          "idAPIfootball": "2790",
          "strSport": "Soccer",
          "strLeague": "English Premier League",
          "strLeagueAlternate": "Premier League",
          "strDivision": "0",
          "idCup": "0",
          "strCurrentSeason": "2020-2021",
          "intFormedYear": "1992",
          "dateFirstEvent": "2000-08-18",
          "strGender": "Male",
          "strCountry": "England",
          "strWebsite": "www.premierleague.com",
          "strFacebook": "en-gb.facebook.com\/premierleague\/",
          "strTwitter": "twitter.com\/premierleague",
          "strYoutube": "www.youtube.com\/channel\/UCG5qGWdu8nIRZqJ_GgDwQ-w",
          "strRSS": "http:\/\/feeds.feedburner.com\/PremierLeagueFootballNews",
          "strDescriptionEN": "The Premier League, often referred to as the English Premier League or the EPL outside England, is the top level of the English football league system. Contested by 20 clubs, it operates on a system of promotion and relegation with the English Football League (EFL). Seasons run from August to May with each team playing 38 matches (playing all 19 other teams both home and away). Most games are played on Saturday and Sunday afternoons.\r\n\r\nThe competition was founded as the FA Premier League on 20 February 1992 following the decision of clubs in the Football League First Division to break away from the Football League, founded in 1888, and take advantage of a lucrative television rights deal. The deal was worth around £1 billion a year domestically as of 2013–14, with Sky and BT Group securing the domestic rights to broadcast 116 and 38 games respectively. The league is a corporation in which the member clubs act as shareholders, and generates €2.2 billion per year in domestic and international television rights. Clubs were apportioned central payment revenues of £2.4 billion in 2016–17, with a further £343 million in solidarity payments to English Football League (EFL) clubs.\r\n\r\nThe Premier League is the most-watched sports league in the world, broadcast in 212 territories to 643 million homes and a potential TV audience of 4.7 billion people. For the 2018–19 season average Premier League match attendance was at 38,181, second to the Bundesliga's 43,500, while aggregated attendance across all matches is the highest of any league at 14,508,981. Most stadium occupancies are near capacity. The Premier League ranks second in the UEFA coefficients of leagues based on performances in European competitions over the past five seasons as of 2019, only behind Spain's La Liga.\r\n\r\nForty-nine clubs have competed since the inception of the Premier League in 1992': forty-seven English and two Welsh clubs. Seven of them have won the title': Manchester United (13), Chelsea (5), Manchester City (4), Arsenal (3), Blackburn Rovers (1), Leicester City (1) and most recently Liverpool (1). The record of most points in a Premier League season is 100, set by Manchester City in 2017–18.",
          "strBanner": "https:\/\/www.thesportsdb.com\/images\/media\/league\/banner\/4m3g4s1520767740.jpg",
          "strBadge": "https:\/\/www.thesportsdb.com\/images\/media\/league\/badge\/pdd43f1610891709.png",
          "strLogo": "https:\/\/www.thesportsdb.com\/images\/media\/league\/logo\/4c377s1535214890.png",
          "strPoster": "https:\/\/www.thesportsdb.com\/images\/media\/league\/poster\/v8d7nf1535455996.jpg",
          "strTrophy": "https:\/\/www.thesportsdb.com\/images\/media\/league\/trophy\/yrywtr1422246014.png",
          "strNaming": "{strHomeTeam} vs {strAwayTeam}",
          "strComplete": "yes",
          "strLocked": "unlocked"
        },
        {
          "idLeague": "4387",
          "idSoccerXML": null,
          "idAPIfootball": "12",
          "strSport": "Basketball",
          "strLeague": "NBA",
          "strLeagueAlternate": "National Basketball Association",
          "strDivision": "0",
          "idCup": "0",
          "strCurrentSeason": "2020-2021",
          "intFormedYear": "1946",
          "dateFirstEvent": "0000-00-00",
          "strGender": "Male",
          "strCountry": "United States",
          "strWebsite": "www.nba.com",
          "strFacebook": "www.facebook.com\/nba",
          "strTwitter": "twitter.com\/nba",
          "strYoutube": "www.youtube.com\/user\/NBA",
          "strRSS": "http:\/\/www.nba.com\/rss\/nba_rss.xml",
          "strDescriptionEN": "The National Basketball Association (NBA) is the pre-eminent men's professional basketball league in North America, and is widely considered to be the premier men's professional basketball league in the world. It has 30 franchised member clubs (29 in the United States and 1 in Canada), and is an active member of USA Basketball (USAB), which is recognized by FIBA (also known as the International Basketball Federation) as the national governing body for basketball in the United States. The NBA is one of the four major North American professional sports leagues. NBA players are the world's best paid sportsmen, by average annual salary per player.\r\n\r\nThe league was founded in New York City on June 6, 1946, as the Basketball Association of America (BAA). The league adopted the name National Basketball Association on August 3, 1949, after merging with its rival National Basketball League (NBL). The league's several international as well as individual team offices are directed out of its head offices located in the Olympic Tower at 645 Fifth Avenue in New York City. NBA Entertainment and NBA TV studios are directed out of offices located in Secaucus, New Jersey.\r\n\r\nThe Basketball Association of America was founded in 1946 by owners of the major ice hockey arenas in the Northeastern and Midwestern United States and Canada. On November 1, 1946, in Toronto, Ontario, Canada, the Toronto Huskies hosted the New York Knickerbockers at Maple Leaf Gardens, in a game the NBA now regards as the first played in its history. The first basket was made by Ossie Schectman of the Knickerbockers. Although there had been earlier attempts at professional basketball leagues, including the American Basketball League and the NBL, the BAA was the first league to attempt to play primarily in large arenas in major cities. During its early years, the quality of play in the BAA was not significantly better than in competing leagues or among leading independent clubs such as the Harlem Globetrotters. For instance, the 1948 ABL finalist Baltimore Bullets moved to the BAA and won that league's 1948 title, and the 1948 NBL champion Minneapolis Lakers won the 1949 BAA title. Prior to the 1948-49 season, however, NBL teams from Fort Wayne, Indianapolis, Minneapolis, and Rochester jumped to the BAA, which established the BAA as the league of choice for collegians looking to turn professional.\r\n\r\nThe headquarters of the National Basketball Association in the Olympic Tower at 645 Fifth Avenue, Midtown Manhattan, New York City, USA.\r\nFollowing the 1948-49 season, the BAA took in the remainder of the NBL': Syracuse, Anderson, Tri-Cities, Sheboygan, Denver, and Waterloo. In deference to the merger and to avoid possible legal complications, the league name was changed from the BAA to the National Basketball Association in spite of having the same BAA governing body including Podoloff. The new league had seventeen franchises located in a mix of large and small cities, as well as large arenas and smaller gymnasiums and armories. In 1950, the NBA consolidated to eleven franchises, a process that continued until 1953–54, when the league reached its smallest size of eight franchises, all of which are still in the league (the New York Knicks, Boston Celtics, Golden State Warriors, Los Angeles Lakers, Royals\/Kings, Detroit Pistons, Atlanta Hawks, and Nationals\/76ers). The process of contraction saw the league's smaller-city franchises move to larger cities. The Hawks shifted from 'Tri-Cities' (the area now known as the Quad Cities) to Milwaukee (in 1951) and then to St. Louis, Missouri (in 1955); the Royals from Rochester, New York to Cincinnati (in 1957); and the Pistons from Fort Wayne, Indiana to Detroit (in 1957).\r\n\r\nJapanese-American Wataru Misaka broke the NBA color barrier in the 1947–48 season when he played for the New York Knicks. He remained the only non-white player in league history prior to the first African-American, Harold Hunter, signing with the Washington Capitols in 1950. Hunter was cut from the team during training camp, but several African-American players did play in the league later that year, including Chuck Cooper with the Celtics, Nathaniel 'Sweetwater' Clifton with the Knicks, and Earl Lloyd with the Washington Capitols. During this period, the Minneapolis Lakers, led by center George Mikan, won five NBA Championships and established themselves as the league's first dynasty. To encourage shooting and discourage stalling, the league introduced the 24-second shot clock in 1954. If a team does not attempt to score a field goal (or the ball fails to make contact with the rim) within 24 seconds of obtaining the ball, play is stopped and the ball given to its opponent.",
          "strBanner": "https:\/\/www.thesportsdb.com\/images\/media\/league\/banner\/0lf9wi1619946204.jpg",
          "strBadge": "https:\/\/www.thesportsdb.com\/images\/media\/league\/badge\/frdjqy1536585083.png",
          "strLogo": "https:\/\/www.thesportsdb.com\/images\/media\/league\/logo\/ypuryw1421971236.png",
          "strPoster": "https:\/\/www.thesportsdb.com\/images\/media\/league\/poster\/vtqtss1447330781.jpg",
          "strTrophy": "https:\/\/www.thesportsdb.com\/images\/media\/league\/trophy\/vwwvxx1421694713.png",
          "strNaming": "{strAwayTeam} @ {strHomeTeam}",
          "strComplete": "yes",
          "strLocked": "unlocked"
        },
        {
          "idLeague": "4424",
          "idSoccerXML": null,
          "idAPIfootball": "1",
          "strSport": "Baseball",
          "strLeague": "MLB",
          "strLeagueAlternate": "Major League Baseball",
          "strDivision": "0",
          "idCup": "0",
          "strCurrentSeason": "2021",
          "intFormedYear": "1869",
          "dateFirstEvent": "2007-03-01",
          "strGender": "Male",
          "strCountry": "United States",
          "strWebsite": "mlb.com",
          "strFacebook": "www.facebook.com\/mlb",
          "strTwitter": "twitter.com\/mlb",
          "strYoutube": "www.youtube.com\/user\/MLB",
          "strRSS": "http:\/\/mlb.mlb.com\/partnerxml\/gen\/news\/rss\/mlb.xml",
          "strDescriptionEN": "Major League Baseball (MLB) is a professional baseball organization that constitutes one of the four major professional sports leagues in North America. It is the oldest league of the four. Teams play in the American League (AL) and National League (NL), which operated as separate legal entities from 1901 and 1876 respectively. In 2000, the leagues merged into a single organization led by the Commissioner of Baseball. The organization oversees minor league baseball leagues, which operate about 240 teams affiliated with the major-league clubs. With the International Baseball Federation, the league also manages the international World Baseball Classic tournament.\r\n\r\nBaseball's first professional team was founded in Cincinnati in 1869. The first few decades of professional baseball were characterized by rivalries between leagues and by players who often jumped from one team or league to another. The period before 1920 in baseball was known as the dead-ball era; players rarely hit home runs during this time. Baseball survived a game-throwing incident known as the Black Sox Scandal in the 1919 World Series. Baseball rose in popularity in the 1920s, and survived potential downturns during the Great Depression and World War II. Shortly after the war, baseball's color barrier was broken by Jackie Robinson.\r\n\r\nThe 1950s and 1960s were a time of expansion for the AL and NL, then new stadiums and artificial turf surfaces began to change the game in the 1970s and 1980s. Home runs dominated the game during the 1990s, and media reports began to discuss the use of anabolic steroids among Major League players in the mid-2000s. In 2006, an investigation produced the Mitchell Report, which implicated many players in the use of performance-enhancing substances, including at least one player from each team.\r\n\r\nToday, MLB is composed of thirty teams': Twenty-nine in the United States and one in Canada. Teams play 162 games each season. Five teams in each league advance to a four-round postseason tournament that culminates in the World Series, a best-of-seven championship series between the two league champions that dates to 1903. Baseball broadcasts are aired throughout North America and in several other countries throughout the world. Games are aired on television, radio, and the Internet. MLB has the highest season attendance of any sports league in the world with more than 74 million spectators in 2013.",
          "strBanner": "https:\/\/www.thesportsdb.com\/images\/media\/league\/banner\/wgxylj1570730728.jpg",
          "strBadge": "https:\/\/www.thesportsdb.com\/images\/media\/league\/badge\/c5r83j1521893739.png",
          "strLogo": "https:\/\/www.thesportsdb.com\/images\/media\/league\/logo\/5g2id01554031836.png",
          "strPoster": "https:\/\/www.thesportsdb.com\/images\/media\/league\/poster\/j6ip3t1534891579.jpg",
          "strTrophy": "https:\/\/www.thesportsdb.com\/images\/media\/league\/trophy\/55ggh41617528995.png",
          "strNaming": "{strAwayTeam} @ {strHomeTeam}",
          "strComplete": "yes",
          "strLocked": "unlocked"
        },
        {
            "idLeague": "4380",
            "idSoccerXML": null,
            "idAPIfootball": "57",
            "strSport": "Ice Hockey",
            "strLeague": "NHL",
            "strLeagueAlternate": "National Hockey League",
            "strDivision": "0",
            "idCup": "0",
            "strCurrentSeason": "2020-2021",
            "intFormedYear": "1917",
            "dateFirstEvent": "2014-09-21",
            "strGender": "Male",
            "strCountry": "United States",
            "strWebsite": "www.nhl.com",
            "strFacebook": "www.facebook.com\/NHL",
            "strTwitter": "twitter.com\/nhl",
            "strYoutube": "www.youtube.com\/user\/NHLVideo",
            "strRSS": "http:\/\/www.nhl.com\/rss\/news.xml",
            "strDescriptionEN": "The National Hockey League (NHL; French: Ligue nationale de hockey—LNH) is a professional ice hockey league composed of 30 member clubs: 23 in the United States and 7 in Canada. Headquartered in New York City, the NHL is widely considered to be the premier professional ice hockey league in the world, and one of the major professional sports leagues in the United States and Canada. The Stanley Cup, the oldest professional sports trophy in North America, is awarded annually to the league playoff champion at the end of each season.\r\n\r\nThe National Hockey League was organized on November 26, 1917, in Montreal, Quebec, after the suspension of operations of its predecessor organization, the National Hockey Association (NHA), which had been founded in 1909 in Renfrew Ontario. It started with four teams (all based in Canada) and, through a series of expansions, contractions, and relocations, is now composed of thirty active franchises. The \"nation\" referred to by the league's name was Canada, although the league has now been binational since 1924 when its first team in the United States, the Boston Bruins, began play. After a labour-management dispute that led to the cancellation of the entire 2004–05 season, the league resumed play under a new collective agreement that included a salary cap. In 2009, the NHL enjoyed record highs in terms of sponsorships, attendance, and television audiences.\r\n\r\nThe league draws many highly skilled players from all over the world and currently has players from approximately 20 different countries. Canadians have historically constituted the majority of the players in the league, with a dramatically increasing percentage of American and European players in recent years.",
            "strBanner": "https:\/\/www.thesportsdb.com\/images\/media\/league\/banner\/wsvtvu1422290020.jpg",
            "strBadge": "https:\/\/www.thesportsdb.com\/images\/media\/league\/badge\/4cem2k1619616539.png",
            "strLogo": "https:\/\/www.thesportsdb.com\/images\/media\/league\/logo\/qguaew1557140752.png",
            "strPoster": "https:\/\/www.thesportsdb.com\/images\/media\/league\/poster\/ttsvur1442078495.jpg",
            "strTrophy": "https:\/\/www.thesportsdb.com\/images\/media\/league\/trophy\/n7h99t1557140860.png",
            "strNaming": "{strAwayTeam} @ {strHomeTeam}",
            "strComplete": "yes",
            "strLocked": "unlocked"
    }
        ]
}
